Repository: omeka/plugin-DerivativeImages
Catalog: languages/*.po
Languages: es

source: The ImageMagick directory path is missing.
es: Falta el directorio de ImageMagick.

source: Derivative Images
es: Imágenes derivadas

source: Omeka attempts to create fullsize, thumbnail, and square thumbnail derivative images when a file is added. This plugin recreates (or creates) derivative images according to the size constraints set in the %sAppearance settings%s. This plugin is useful if image sizes must change for a new theme, after upgrading from an earlier version of Omeka, or after your server's %sImageMagick%s software has been upgraded.
es: Cuando se añade un archivo, Omeka trata de crear las siguientes imágenes derivadas: fullsize, thumbnail, y thumbnail cuadrado. Este plugin recrea (o crea) las imágenes derivadas de acuerdo a las restricciones de tamaño configuradas en %sAppearance settings%s. Este plugin es útil si es necesario cambiar el tamaño de las imágenes para un nuevo theme, después de actualizar desde una versión más antigua de Omeka, o después de actualizar %sImageMagick%s en su servidor.

source: Please note that Omeka is unable to create derivative images for some files. We highly recommend that you back up Omeka's files directory before running this process.
es: Por favor tenga en cuenta que Omeka no puede crear las imágenes derivadas de algunos archivos. Recomendamos fuertemente que realice un backup de su directorio de archivos de Omeka antes de correr este proceso.

source: Process type
es: Tipo de proceso

source: Select files for creating new derivative images.
es: Seleccionar archivos de los cuales crear nuevas imágenes derivadas.

source: All files
es: Todos los archivos

source: Files that have derivative images
es: Archivos que ya tienen imágenes derivadas

source: Files that do not have derivative images
es: Archivos que NO tienen imágenes derivadas

source: Image sizes
es: Tamaños de imágenes

source: Select which image sizes you want to create. Checking none will create all image sizes. (Sizes listed here are set in the %sAppearance settings%s.)
es: Elija los tamaños de imagen que desea crear. Si no marca ninguno, se crearán todos. (Los que aquí figuran son los que han sido configurados en %sAppearance settings%s).

source: Square thumbnail
es: Thumbnail cuadrado

source: pixels
es: píxeles

source: Select which file MIME types you want to process. Checking none will process all MIME types. (This list represents every MIME type currently available in this Omeka site.)
es: Seleccione el tipo de archivo MIME que desea procesar. Si no marca ninguno, se procesarán todos. (Esta lista representa los MIME type actualmente disponibles en este sitio Omeka).

source: Process Files
es: Procesar archivos
